# SQLAlchemy: SQL and ORM

We will follow a series of exercises to get familiar with SQL and ORM.

ORM can be an abstract concept, to help you compare, the exercises will be a combination of traditional queries and SQLAlchemy queries.

`SQLAlchemy` is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL.

It provides a full suite of well known enterprise-level persistence patterns, designed for efficient and high-performing database access, adapted into a simple and Pythonic domain language.

Installing The Package:

```pip install sqlalchemy```

## Setting up your notebook
To facilitate developing, you can run this notebook on a [Google Colab](https://colab.research.google.com/).

In [10]:
# Load the SQL magic extension
# https://github.com/ploomber/jupysql
# this extension allows us to connect to DBs and issue SQL commands
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
# To run SQL code in a Jupyter notebook cell, you can use the magic command %%sql

In [12]:
"""%%sql
SELECT sqlite_version();"""

'%%sql\nSELECT sqlite_version();'

After running the previous cell, we encounter the error `UsageError: No active connection.` This is due to the fact a connection with a database has not been established.

## Create a database with SQL Alchemy

The ***Declarative Mapping*** is the typical way that mappings are constructed in modern SQLAlchemy. Read more: [Declarative mapping and alternatives](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html#orm-declarative-mapping).

In [13]:
from sqlalchemy import Column, Integer, String, ForeignKey
from sqlalchemy.orm import declarative_base
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

# declarative base class
Base = declarative_base()

# an example mapping using the base
class User(Base):
    __tablename__ = 'user'

    id = Column(Integer, primary_key=True)
    name = Column(String)
    fullname = Column(String)
    nickname = Column(String)

The `Engine` is the starting point for any SQLAlchemy application, it represents a Python object that can be used to interact directly with the database and can be passed to a Session object to work with the ORM,

The `create_engine()`  function produces an `Engine` object based on a URL.

In [14]:
engine = create_engine('sqlite:///MyDataBase.db')

*Note the use of `///` to indicate a relative file path.*

In [15]:
print(type(engine))

<class 'sqlalchemy.engine.base.Engine'>

The typical form of a database URL is:
`dialect+driver://username:password@host:port/database`

In this case we are using [SQLite](https://www.sqlite.org/index.html) a database engine broadly used worldwide for desktop and mobile aplications and provides the advantage of containing the database into one file `DB.db`.

Among the supported databases on sql alchemy we can list:

- SQLite
- PosgreSQL
- MySQL
- Oracle
- Microsoft SQL Server

The `Table object` is a member of a larger collection known as `MetaData`. When using Declarative, this object is available using the `.metadata attribute` of our declarative base class.

The `MetaData` is a registry which includes the ability to emit a limited set of schema generation commands to the database. As our database does not actually have a users table present, we can use `MetaData` to issue CREATE TABLE statements to the database for all tables that don’t yet exist.

In [16]:
# Create database following parameters defined in `Base`
Base.metadata.create_all(engine)

Refresh local files of your working directory, now you should be able to see the file `MyDataBase.db`.

In [17]:
# Connecting to the database
%sql sqlite:///MyDataBase.db

Connecting to 'sqlite:///MyDataBase.db'

In [18]:
%%sql
-- # In SQL the comments are declared with --
-- # Example: Query to select values on table "user" from MyDataBase.db
SELECT * FROM user;

Running query in 'sqlite:///MyDataBase.db'

+----+------+----------+----------+
| id | name | fullname | nickname |
+----+------+----------+----------+
+----+------+----------+----------+

The table `user` declared previously on `class User(Base)` exist on the database but no data has been stored yet.

# Database sessions

A `DBSession()` instance establishes all conversations with the database during your session. 
- Any change made against the objects in the session won't be persisted into the database until you call: `session.commit()`. *(just like using Git...)*

- If you're not happy about the changes, you can revert all of them back to the last commit by calling `session.rollback()`.

In [19]:
# Bind the engine to the metadata of the Base class so that the
# declaratives can be accessed through a DBSession instance
Base.metadata.bind = engine
DBSession = sessionmaker(bind=engine)
session = DBSession()

## Insert information into table *ORM approach*

In [20]:
# Using `class User(Base)` to input new parameters into the table `user`
my_first_table = User(name="Arnold", fullname="Arnold Schwarzenegger", nickname="Terminator")

In [21]:
# Add and commit changes to table `user`
session.add(my_first_table)
session.commit()
print(my_first_table)

<__main__.User object at 0x0000021124046660>

`my_first_table` is a Python object, what means we can interact with the table in the same way done with other functions:

In [22]:
print(my_first_table.id)
print(my_first_table.name)
print(my_first_table.fullname)
print(my_first_table.nickname)

1
Arnold
Arnold Schwarzenegger
Terminator

## Insert information to table *using Queries*

Instead of using `class User(Base)`, we will add the values to the table using directly SQL queries. This, with the purpose of ilustrate with a pragmatical example the working methods using ORM vs SQL queries.

In [23]:
%%sql

-- # Insert values into the table `user`

INSERT INTO user(id, name, fullname, nickname)
    VALUES (2, 'Jennifer', 'Jennifer Aniston', 'Rachel'), 
    (3, 'Tyrannosaurus','Tyrannosaurus Rex', 'T-Rex'), 
    (4, 'Neil', 'Neil Patrick Harris', 'Barney Stinson'),
    (5, 'Aegon', 'Aegon Targaryen', 'John Snow');

Running query in 'sqlite:///MyDataBase.db'

4 rows affected.

++
||
++
++

To check your information was inserted correctly you can open your database or use one of the many VSCode extentions to view SQLite databases (e.g. SQL Viewer).

## Exercises: 

1. Use the `class User` to insert 5 rows of data into the table `user`
2. Insert 5 additional rows but this time using queries

In [24]:
## Your code: ORM Approach

first_row = User(name="Arnold", fullname="Arnold Schwarzenegger", nickname="Terminator")
session.add(first_row)
second_row= User(name="Arnoldd", fullname="Arnold Schwarzenegger", nickname="Terminator")
session.add(second_row)
third_row= User(name="Arnolddd", fullname="Arnold Schwarzenegger", nickname="Terminator")
session.add(third_row)
fourth_row=User(name="Arnoldddd", fullname="Arnold Schwarzenegger", nickname="Terminator")
session.add(fourth_row)
fifth_row= User(name="Arnolddddd", fullname="Arnold Schwarzenegger", nickname="Terminator")
session.add(fifth_row)


session.commit()

In [26]:
%%sql

--# Your code: Using SQL Queries

INSERT INTO user(id, name, fullname, nickname)
    VALUES (11, 'BBBBBB', 'Jennifer Aniston', 'Rachel'), 
    (12, 'FFFFF','Tyrannosaurus Rex', 'T-Rex'), 
    (13, 'HHHHHHH', 'Neil Patrick Harris', 'Barney Stinson'),
    (14, 'KKKKK', 'Aegon Targaryen', 'John Snow'),
    (15, "BBBB", "AAAAAAA","VVVVV");

Running query in 'sqlite:///MyDataBase.db'

5 rows affected.

++
||
++
++

## Preview values in table

You can also preview the values in a particular table by using queries and the ORM approach.

### *Using queries:*

In [27]:
%%sql

SELECT * FROM user;

Running query in 'sqlite:///MyDataBase.db'

+----+---------------+-----------------------+----------------+
| id |      name     |        fullname       |    nickname    |
+----+---------------+-----------------------+----------------+
| 1  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 2  |    Jennifer   |    Jennifer Aniston   |     Rachel     |
| 3  | Tyrannosaurus |   Tyrannosaurus Rex   |     T-Rex      |
| 4  |      Neil     |  Neil Patrick Harris  | Barney Stinson |
| 5  |     Aegon     |    Aegon Targaryen    |   John Snow    |
| 6  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 7  |    Arnoldd    | Arnold Schwarzenegger |   Terminator   |
| 8  |    Arnolddd   | Arnold Schwarzenegger |   Terminator   |
| 9  |   Arnoldddd   | Arnold Schwarzenegger |   Terminator   |
| 10 |   Arnolddddd  | Arnold Schwarzenegger |   Terminator   |
+----+---------------+-----------------------+----------------+
Truncated to displaylimit of 10.

### *ORM approach*:

The inspection module provides the `inspect()` function, which delivers runtime information about a wide variety of SQLAlchemy objects, both within the Core as well as the ORM.

The `inspect()` function is the entry point to SQLAlchemy’s public API for viewing the configuration and construction of in-memory objects. Read more: https://docs.sqlalchemy.org/en/20/core/inspection.html.

In [28]:
from sqlalchemy import inspect
inspector = inspect(engine)

# Get table information
print(inspector.get_table_names())

['user']

In [29]:
# Get values in table:

print("----> User by (name):")
query = session.query(User)
for _row in query.all():
    print(_row.id, _row.name, _row.fullname, _row.nickname)

----> User by (name):
1 Arnold Arnold Schwarzenegger Terminator
2 Jennifer Jennifer Aniston Rachel
3 Tyrannosaurus Tyrannosaurus Rex T-Rex
4 Neil Neil Patrick Harris Barney Stinson
5 Aegon Aegon Targaryen John Snow
6 Arnold Arnold Schwarzenegger Terminator
7 Arnoldd Arnold Schwarzenegger Terminator
8 Arnolddd Arnold Schwarzenegger Terminator
9 Arnoldddd Arnold Schwarzenegger Terminator
10 Arnolddddd Arnold Schwarzenegger Terminator
11 BBBBBB Jennifer Aniston Rachel
12 FFFFF Tyrannosaurus Rex T-Rex
13 HHHHHHH Neil Patrick Harris Barney Stinson
14 KKKKK Aegon Targaryen John Snow
15 BBBB AAAAAAA VVVVV

### Exercises: 

1. Modify the code of the previous cell to stored the printed values on:

    a. A pandas DataFrame
    
    b. A dictionary

In [34]:
import pandas as pd
# your awesome code
query = session.query(User)

list_of_dict = []
for _row in query.all():
    dict={"index":_row.id, "name":_row.name, "full name":_row.fullname, "nickname":_row.nickname}
    list_of_dict.append(dict)
print(list_of_dict)

df = pd.DataFrame(list_of_dict)
df

[{'index': 1, 'name': 'Arnold', 'full name': 'Arnold Schwarzenegger', 'nickname': 'Terminator'}, {'index': 2, 'name': 'Jennifer', 'full name': 'Jennifer Aniston', 'nickname': 'Rachel'}, {'index': 3, 'name': 'Tyrannosaurus', 'full name': 'Tyrannosaurus Rex', 'nickname': 'T-Rex'}, {'index': 4, 'name': 'Neil', 'full name': 'Neil Patrick Harris', 'nickname': 'Barney Stinson'}, {'index': 5, 'name': 'Aegon', 'full name': 'Aegon Targaryen', 'nickname': 'John Snow'}, {'index': 6, 'name': 'Arnold', 'full name': 'Arnold Schwarzenegger', 'nickname': 'Terminator'}, {'index': 7, 'name': 'Arnoldd', 'full name': 'Arnold Schwarzenegger', 'nickname': 'Terminator'}, {'index': 8, 'name': 'Arnolddd', 'full name': 'Arnold Schwarzenegger', 'nickname': 'Terminator'}, {'index': 9, 'name': 'Arnoldddd', 'full name': 'Arnold Schwarzenegger', 'nickname': 'Terminator'}, {'index': 10, 'name': 'Arnolddddd', 'full name': 'Arnold Schwarzenegger', 'nickname': 'Terminator'}, {'index': 11, 'name': 'BBBBBB', 'full name': 'Jennifer Aniston', 'nickname': 'Rachel'}, {'index': 12, 'name': 'FFFFF', 'full name': 'Tyrannosaurus Rex', 'nickname': 'T-Rex'}, {'index': 13, 'name': 'HHHHHHH', 'full name': 'Neil Patrick Harris', 'nickname': 'Barney Stinson'}, {'index': 14, 'name': 'KKKKK', 'full name': 'Aegon Targaryen', 'nickname': 'John Snow'}, {'index': 15, 'name': 'BBBB', 'full name': 'AAAAAAA', 'nickname': 'VVVVV'}]

    index           name              full name        nickname
0       1         Arnold  Arnold Schwarzenegger      Terminator
1       2       Jennifer       Jennifer Aniston          Rachel
2       3  Tyrannosaurus      Tyrannosaurus Rex           T-Rex
3       4           Neil    Neil Patrick Harris  Barney Stinson
4       5          Aegon        Aegon Targaryen       John Snow
5       6         Arnold  Arnold Schwarzenegger      Terminator
6       7        Arnoldd  Arnold Schwarzenegger      Terminator
7       8       Arnolddd  Arnold Schwarzenegger      Terminator
8       9      Arnoldddd  Arnold Schwarzenegger      Terminator
9      10     Arnolddddd  Arnold Schwarzenegger      Terminator
10     11         BBBBBB       Jennifer Aniston          Rachel
11     12          FFFFF      Tyrannosaurus Rex           T-Rex
12     13        HHHHHHH    Neil Patrick Harris  Barney Stinson
13     14          KKKKK        Aegon Targaryen       John Snow
14     15           BBBB                AAAAAAA           VVVVV

2. Insert new table using queries

In [35]:
%%sql

CREATE TABLE media (
    id          INTEGER PRIMARY KEY NOT NULL,
    production  TEXT NOT NULL,
    year        NUMBER NOT NULL
    );

Running query in 'sqlite:///MyDataBase.db'

++
||
++
++

In [36]:
%%sql
--# Insert values on table `media`
INSERT INTO media(id, production, year)
    VALUES (1,'Terminator',1984), 
    (2,'Friends', 1994), 
    (3,'Toy Story', 1995), 
    (4,'How I met your mother', 2005),
    (5,'Game of thrones',2011);

Running query in 'sqlite:///MyDataBase.db'

5 rows affected.

++
||
++
++

In [37]:
%%sql

SELECT * FROM media;

Running query in 'sqlite:///MyDataBase.db'

+----+-----------------------+------+
| id |       production      | year |
+----+-----------------------+------+
| 1  |       Terminator      | 1984 |
| 2  |        Friends        | 1994 |
| 3  |       Toy Story       | 1995 |
| 4  | How I met your mother | 2005 |
| 5  |    Game of thrones    | 2011 |
+----+-----------------------+------+

3. Complete the values on the table `media` that corresponds to your previous inputs on the table `user`.

In [41]:
%%sql
--# Insert values on table `media`
INSERT INTO media(id, production, year)
    VALUES (6,'Terminator',1984), 
    (7,'Terminator',1984), 
    (8,'Terminator',1984), 
    (9,'Terminator',1984),
    (10,'Terminator',1984),
    (11,"La maison de Mickey", 2012),
    (12,"La maison de Mickey", 2012),
    (13,"La maison de Mickey", 2012),
    (14,"La maison de Mickey", 2012),
    (15,"La maison de Mickey", 2012);

Running query in 'sqlite:///MyDataBase.db'

10 rows affected.

++
||
++
++

### Well done! Now you have more tools as part of your skillset!

You are also ready for this joke: *An SQL query walks into a bar and sees two tables. He walks up to them and says:*

<img src='https://cdn.dribbble.com/users/1463678/screenshots/3212815/tables-dribbble.png' width = 500px></img>

## Resources:
- [Introduction to Relational Databases in Python (DataCamp)](https://app.datacamp.com/learn/courses/introduction-to-relational-databases-in-python)
- [ORM For Python: SQLAlchemy 101](https://medium.com/@haataa/orm-for-python-sqlalchemy-101-with-code-example-60868e65b0c)
- [Read the docs](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html)
- [Tutorial FastAPI and working with databases](https://fastapi.tiangolo.com/tutorial/sql-databases/)
- [SQL query practice](https://www.sql-practice.com/)
- [SQL workshop](https://tdmdal.github.io/mma-sql/)